; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p13---int100n150-m25---int100c200---s234---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level15 level15)
(sum level0 level25 level25)
(sum level1 level3 level4)
(sum level1 level15 level16)
(sum level1 level25 level26)
(sum level2 level3 level5)
(sum level2 level15 level17)
(sum level2 level25 level27)
(sum level3 level3 level6)
(sum level3 level15 level18)
(sum level3 level25 level28)
(sum level4 level3 level7)
(sum level4 level15 level19)
(sum level4 level25 level29)
(sum level5 level3 level8)
(sum level5 level15 level20)
(sum level5 level25 level30)
(sum level6 level3 level9)
(sum level6 level15 level21)
(sum level6 level25 level31)
(sum level7 level3 level10)
(sum level7 level15 level22)
(sum level7 level25 level32)
(sum level8 level3 level11)
(sum level8 level15 level23)
(sum level8 level25 level33)
(sum level9 level3 level12)
(sum level9 level15 level24)
(sum level9 level25 level34)
(sum level10 level3 level13)
(sum level10 level15 level25)
(sum level10 level25 level35)
(sum level11 level3 level14)
(sum level11 level15 level26)
(sum level11 level25 level36)
(sum level12 level3 level15)
(sum level12 level15 level27)
(sum level12 level25 level37)
(sum level13 level3 level16)
(sum level13 level15 level28)
(sum level13 level25 level38)
(sum level14 level3 level17)
(sum level14 level15 level29)
(sum level14 level25 level39)
(sum level15 level3 level18)
(sum level15 level15 level30)
(sum level15 level25 level40)
(sum level16 level3 level19)
(sum level16 level15 level31)
(sum level16 level25 level41)
(sum level17 level3 level20)
(sum level17 level15 level32)
(sum level17 level25 level42)
(sum level18 level3 level21)
(sum level18 level15 level33)
(sum level18 level25 level43)
(sum level19 level3 level22)
(sum level19 level15 level34)
(sum level19 level25 level44)
(sum level20 level3 level23)
(sum level20 level15 level35)
(sum level20 level25 level45)
(sum level21 level3 level24)
(sum level21 level15 level36)
(sum level21 level25 level46)
(sum level22 level3 level25)
(sum level22 level15 level37)
(sum level22 level25 level47)
(sum level23 level3 level26)
(sum level23 level15 level38)
(sum level23 level25 level48)
(sum level24 level3 level27)
(sum level24 level15 level39)
(sum level24 level25 level49)
(sum level25 level3 level28)
(sum level25 level15 level40)
(sum level25 level25 level50)
(sum level26 level3 level29)
(sum level26 level15 level41)
(sum level26 level25 level51)
(sum level27 level3 level30)
(sum level27 level15 level42)
(sum level27 level25 level52)
(sum level28 level3 level31)
(sum level28 level15 level43)
(sum level28 level25 level53)
(sum level29 level3 level32)
(sum level29 level15 level44)
(sum level29 level25 level54)
(sum level30 level3 level33)
(sum level30 level15 level45)
(sum level30 level25 level55)
(sum level31 level3 level34)
(sum level31 level15 level46)
(sum level31 level25 level56)
(sum level32 level3 level35)
(sum level32 level15 level47)
(sum level32 level25 level57)
(sum level33 level3 level36)
(sum level33 level15 level48)
(sum level33 level25 level58)
(sum level34 level3 level37)
(sum level34 level15 level49)
(sum level34 level25 level59)
(sum level35 level3 level38)
(sum level35 level15 level50)
(sum level35 level25 level60)
(sum level36 level3 level39)
(sum level36 level15 level51)
(sum level36 level25 level61)
(sum level37 level3 level40)
(sum level37 level15 level52)
(sum level37 level25 level62)
(sum level38 level3 level41)
(sum level38 level15 level53)
(sum level38 level25 level63)
(sum level39 level3 level42)
(sum level39 level15 level54)
(sum level39 level25 level64)
(sum level40 level3 level43)
(sum level40 level15 level55)
(sum level40 level25 level65)
(sum level41 level3 level44)
(sum level41 level15 level56)
(sum level41 level25 level66)
(sum level42 level3 level45)
(sum level42 level15 level57)
(sum level42 level25 level67)
(sum level43 level3 level46)
(sum level43 level15 level58)
(sum level43 level25 level68)
(sum level44 level3 level47)
(sum level44 level15 level59)
(sum level44 level25 level69)
(sum level45 level3 level48)
(sum level45 level15 level60)
(sum level45 level25 level70)
(sum level46 level3 level49)
(sum level46 level15 level61)
(sum level46 level25 level71)
(sum level47 level3 level50)
(sum level47 level15 level62)
(sum level47 level25 level72)
(sum level48 level3 level51)
(sum level48 level15 level63)
(sum level48 level25 level73)
(sum level49 level3 level52)
(sum level49 level15 level64)
(sum level49 level25 level74)
(sum level50 level3 level53)
(sum level50 level15 level65)
(sum level50 level25 level75)
(sum level51 level3 level54)
(sum level51 level15 level66)
(sum level51 level25 level76)
(sum level52 level3 level55)
(sum level52 level15 level67)
(sum level52 level25 level77)
(sum level53 level3 level56)
(sum level53 level15 level68)
(sum level53 level25 level78)
(sum level54 level3 level57)
(sum level54 level15 level69)
(sum level55 level3 level58)
(sum level55 level15 level70)
(sum level56 level3 level59)
(sum level56 level15 level71)
(sum level57 level3 level60)
(sum level57 level15 level72)
(sum level58 level3 level61)
(sum level58 level15 level73)
(sum level59 level3 level62)
(sum level59 level15 level74)
(sum level60 level3 level63)
(sum level60 level15 level75)
(sum level61 level3 level64)
(sum level61 level15 level76)
(sum level62 level3 level65)
(sum level62 level15 level77)
(sum level63 level3 level66)
(sum level63 level15 level78)
(sum level64 level3 level67)
(sum level65 level3 level68)
(sum level66 level3 level69)
(sum level67 level3 level70)
(sum level68 level3 level71)
(sum level69 level3 level72)
(sum level70 level3 level73)
(sum level71 level3 level74)
(sum level72 level3 level75)
(sum level73 level3 level76)
(sum level74 level3 level77)
(sum level75 level3 level78)

(connected l0 l1)
(fuelcost level3 l0 l1)
(connected l0 l2)
(fuelcost level15 l0 l2)
(connected l1 l0)
(fuelcost level3 l1 l0)
(connected l1 l2)
(fuelcost level25 l1 l2)
(connected l2 l0)
(fuelcost level15 l2 l0)
(connected l2 l1)
(fuelcost level25 l2 l1)

(at t0 l0)
(fuel t0 level78)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
(at p2 l2)
(at p3 l1)
(at p4 l2)
(at p5 l1)
(at p6 l2)
(at p7 l2)
(at p8 l2)
(at p9 l1)
(at p10 l1)
(at p11 l0)
(at p12 l1)
)

(:goal
(and
(at p0 l1)
(at p1 l0)
(at p2 l0)
(at p3 l2)
(at p4 l0)
(at p5 l2)
(at p6 l1)
(at p7 l0)
(at p8 l1)
(at p9 l2)
(at p10 l0)
(at p11 l1)
(at p12 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 0 of 13
2. (drive t0 l0 l1 level75 level3 level78)
   deleted: (at t0 l0) (fuel t0 level78)
   added: (at t0 l1) (fuel t0 level75)
   goals met: 0 of 13
3. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 0 of 13
4. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 13
5. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 13
6. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 0 of 13
7. (drive t0 l1 l2 level50 level25 level75)
   deleted: (at t0 l1) (fuel t0 level75)
   added: (at t0 l2) (fuel t0 level50)
   goals met: 0 of 13
8. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 1 of 13
9. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 2 of 13
10. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 3 of 13
11. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 4 of 13
12. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 4 of 13
13. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 4 of 13
14. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 4 of 13
15. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 4 of 13
16. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 4 of 13
17. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 4 of 13
18. (drive t0 l2 l1 level25 level25 level50)
   deleted: (at t0 l2) (fuel t0 level50)
   added: (at t0 l1) (fuel t0 level25)
   goals met: 4 of 13
19. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 5 of 13
20. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 6 of 13
21. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 7 of 13
22. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 7 of 13
23. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 7 of 13
24. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 8 of 13
25. (drive t0 l1 l0 level22 level3 level25)
   deleted: (at t0 l1) (fuel t0 level25)
   added: (at t0 l0) (fuel t0 level22)
   goals met: 8 of 13
26. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 9 of 13
27. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 10 of 13
28. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 11 of 13
29. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 12 of 13
30. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 13 of 13
